class Uzb_language:

    class start:
        start = '“Реклама биржаси” – реклама жойлаштириш учун реклама берувчилар ва блогерлар бир-бирларини топишига ' \
                'ёрдам берувчи ботдир. Бот ўзаро ҳамкорлик қилиш, шартлар ва тўловларни муҳокама қилиш учун қулай ' \
                'интерфейсга эга. Реклама берувчилар блогерларни мавзу ва аудитория бўйича қидириб топиши, реклама ' \
                'жойлаштириш учун тўловни амалга ошириши ҳамда натижаларни кузатиши мумкин. Блогерлар рекламани ' \
                'жойлаштириши, даромад олиши ва манфаатдор реклама берувчилар билан боғланиши мумкин.\n\n' \
                'Бизнинг бот 200 дан ортиқ телеграм каналлари ва мамлакатда энг машҳур Instagram, Telegram ва ' \
                'YouTubeдаги блогерларни ўзида бирлаштиради. AgroBank, UzAuto motors, InfinBank, Korzinka, Elmakon  ' \
                'каби йирик компаниялар ва бошқалар бизнинг мижозларимиздир.Биз кенг аудиторияни қамраб олиш ' \
                'имкониятини ва рекламада юқори конверсияга эришишни таъминлаймиз.'

        greeting = "Хуш келибсиз!"
        blogger = "💬 Блогер"
        advertiser = "🚀 Реклама берувчи"
        language = "🇷🇺|🇺🇿"

    class menu:

        class blogger:
            menu = "🏠 Асосий меню"
            platform = "💬 Менинг майдончаларим"
            activeOrder = "🗓 Реклама буюртмалари"
            account = "👤 Менинг профилим"
            wallet = "💳 Ҳамён"
            information = "ℹ Инфо"
            lang = "🇷🇺|🇺🇿"
            change = "🔄 Реклама берувчи интерфейси"

        class advertiser:
            menu = "🏠 Асосий меню"
            formOrder = "🚀 Буюртмани расмийлаштириш"
            activeOrder = "🗓 Реклама буюртмалари"
            basket = "🛒 Менинг харид саватим"
            account = "👤 Менинг профилим"
            wallet = "💳 Ҳамён"
            information = "ℹ Инфо"
            lang = "🇷🇺|🇺🇿"
            change = "🔄 Блогер интерфейси"

        class group:
            moderation = "💬 Площадки на модерации"
            withdraw = "💵 Заявки на вывод средств"
            banPlatform = "⛔ Забанить/Разбанить площадку"

    class information:
        about_us = "ℹ Сервис ҳақида"
        how_to_use = "❓ Қандай фойдаланиш керак"
        feedback = "☎ Қайта алоқа"
        rules = "Серсис правиласи"

    class feedback:
        feedback = "Биз билан қуйидаги контактлар орқали боғланишингиз мумкин👇\n\n" \
                   "Телеграм: @VenkonPR\n" \
                   "Почта: pr@venkon.uz\n" \
                   "Телефон: +998(90)799-79-79"

    class symbol:
        sum = 'сўм'

    class settings:
        rus = "🇷🇺 Ru"
        ozb = "🇺🇿 O’z"
        # eng = "🇺🇸 Eng"
        language = [rus, ozb]

    class url:
        class blogger:
            about_us = "https://telegra.ph/O-servise-10-13"
            how_to_use = "https://telegra.ph/Kak-ispolzovat-10-13"

        class advertiser:
            how_to_use = "https://telegra.ph/Kak-ispolzovat-10-13-2"
            about_us = "https://telegra.ph/O-servise-10-13-2"
            rules = "https://telegra.ph/Pravila-servisa-10-13"

        class common:
            rules = "https://telegra.ph/Pravila-servisa-10-13"

    class buttons:

        class filters:
            class subscribers:
                asc = "✅ 👥 ↓"
                desc = "✅ 👥 ↑"
                default = "👥 ↑ ↓"

            class money:
                asc = "✅ 💵 ↓"
                desc = "✅ 💵 ↑"
                default = "💵 ↑ ↓"

        class common:
            start = "🚀 Бошлаймиз"
            back = "⬅Ортга"
            cont = "➡Давом эттириш"
            confirm = "➡Тасдиқлаш"
            accept = "✅Тасдиқлаш"
            menu = "🏠 Асосий меню"
            skip = "⏩ Ўтказиб юбориш"
            nextTime = "⏩ Кейинроқ тўлдириш"
            alright = "✅ Ҳаммаси тўғри"
            forgotPassword = "Паролни унутдим"
            clean = "🔄 Бекор қилиш"
            prev = "◀"
            next = "▶"
            basket = "🛒 Менинг харид саватим"
            task = "✍ белгилар сони ҳаддан ташқари кўп "
            backOrder = "🔙 Буюртмага қайтиш"

        class registration:
            agree = "✅ Розиман"
            have_account = "Менда аккаунт бор"
            code = "Кодни қайта юбориш"
            resend = "Кодни қайта юбориш"

        class platform:
            add = "➕ Майдонча қўшиш"
            delete = "❌ Ўчириб юбориш"
            authorization = "✅ Авторизация килиш"
            check = "🔎 Текшириш"
            accept = "✅ Ҳаммаси тўғри"
            reject = "⛔ Лойиҳани рад этиш"

            class main:
                change = "✍️ Маълумотларни ўзгартириш"
                calendar = "🗓 Меннинг календарь"
                delete = "❌ Майдончани ўчириб юбориш"

            class change:
                title = "Номни ўзгартириш"
                description = "Тавсифни ўзгартириш"
                parameters = "Аудитория параметрлари"
                price = "Реклама жойлаштириш нархи"

            class parameters:
                sex = "Жинс"
                age = "Ёш"
                lang = "Тил"
                region = "Ҳудуд"

        class personalData:
            changeAccount = "🔄 Аккаунтни ўзгартириш"
            logoutAccount = "🚪 Аккаунтдан чиқиш"

            addData = "➕Маълумотларни киритиш"
            entity = "➕Юридик шахс маълумотларини киритиш"
            individual = "➕ЯТТ маълумотларини киритиш"
            selfEmployedCard = "➕Ўзини ўзи банд қилган сифатида киритиш (UZCARD/HUMO)"
            selfEmployedAccount = "➕Ўзини ўзи банд қилган сифатида киритиш (ҳисоб рақами)"

            changeData = "✍️Маълумотларни ўзгартириш"
            newData = "➕ Янги маълумотлар қўшиш"
            logout = "🚪 Ҳа, аккаунтдан чиқаман"

            fio = "Ф.И.Ш."
            fioCard = "Ф.И.Ш. (UZCARD/HUMOда)"
            number = "Рўйхатдан ўтиш рақами"
            date = "Рўйхатдан ўтган сана"

            titleFirm = "Компаниянинг номи"
            titleIndividual = "Якка тартибдаги тадбиркорнинг номи"

            legalAddress = "Юридик манзили"
            transitAccount = "Транзит ҳисоб рақами"
            inn = "ИНН"
            pinfl = "ЖШШИР"
            paymentAccount = "Ҳисоб рақами"
            bank = "Банк номи"
            mfo = "Банк МФО"
            phone = "Телефон"
            cardNumber = "Карта рақами (UZCARD/HUMO)"
            cardDate = "Карта санаси (UZCARD/HUMO)"

        class wallet:

            balance = "➕ Балансни тўлдириш"
            withdraw = "➖ Пул ечиб олиш"
            history = "🗓 Транзакциялар тарихи"
            moreHistory = "🗓Кўпроқ кўриш"
            entity = "Юридик шахс сифатида"
            individual = "ЯТТ сифатида"
            selfEmployed2 = "Жисмоний шахс сифатида"
            selfEmployedAccount = "Ўзини ўзи банд қилган шахс  ((ҳисоб рақами)"
            selfEmployedCard = "Ўзини ўзи банд қилган шахс  (UZCARD/HUMO)"
            emp = "Ўзини ўзи банд қилган"
            payme = "Payme"
            click = "Click"
            payment = "✅ Тўлаш"

            acceptWithdraw = "✅ Маблағ ечиб олинди"
            rejectWithdraw = "⛔ Тўловни бекор қилиш"

        class formOrder:
            category = "Бизнес категорияси"
            parameters = "Аудитория параметрлари"
            network = "Ижтимоий тармоқ"
            addBasket = "🛒 Саватчага қўшиш"
            search = "🔎 Қидирув ва фильтрлар"
            find = "🔎 Излаш"
            media = "Медиафайлларни қўшиш"
            comment = "Топшириққа қўшимча изоҳ бериш"
            url = "URL-тугмалар (telegram)"
            allTime = "Исталган вақт"
            order = "✅ Буюртмани расмийлаштириш"
            checkPost = "✍ Tопшириқни кўриш"

        class newPost:
            accept = "✅ Қабул қилиш"
            checkPost = "✍ Реклама постини кўриш"
            reject = "⛔ Рад этиш"
            cancel = "Барибир рад этиш"

        class post:
            check = "🔎 Текширувга юбориш "
            post = "✍️ Реклама постини кўриш "
            advertiser = "💬 Хабар йўллаш"
            cancel = "⛔ Лойиҳани рад этиш"
            task = "✍️Вазифани қўриш"
            blogger = "💬 Хабар йўллаш"
            accept = "✅ Тасдиқлаш"
            reject = "⛔ Буюртма бажарилмади"
            moderation = "Ҳа, текширувга юбориш"
            toBlogger = "💬 Блогер фойдасига"
            toAdvertiser = "🚀 Реклама берувчи фойдасига"
            rate = "⭐ Майдончани баҳолаш"

        class banPlatform:
            ban = "⛔ Забанить"
            unban = "✅ Разбанить"

    class registration:
        class existAccount:
            login = "<b>Аккаунтга кириш</b>\n\nАккаунтингизга боғлганган электрон почта манзилини киритинг👇"
            password = "<b>Аккаунтга кириш</b>\n\nПаролни киритинг"
            email = "<b>Паролни қайта тиклаш</b>\n\nКод электрон почтага юборилди"
            code = "Тасдиқлаш кодини киритинг👇"
            newPassword = "<b>Аккаунтни қайта тиклаш</b>\n\n" \
                          "Ишончли пароль киритинг👇\n" \
                          "<i>Камида 8 белги</i>"

        class advertiser:
            about = "Бизнинг бот 200 дан ортиқ телеграм каналлари ва мамлакатда энг машҳур Instagram, " \
                    "Telegram ва YouTubeдаги блогерларни ўзида бирлаштиради. " \
                    "Бу эса реклама жойлаштириш учун энг мос платформаларни танлаш имконини беради.\n\n" \
                    "- Рекламани тез ва осон жойлаштириш\n\n" \
                    "- Вақт ҳамда маблағни тежаш имкони: бизнинг ботдан фойдаланиш қидирув ва блогерлар билан " \
                    "мулоқот учун вақт ҳамда нархни камайтиради.\n\n" \
                    "- Натижалар мониторинги: бизнинг бот реклама кампанияси натижаларини кузатиб боради, бу эса " \
                    "самарадорликни баҳолаш ва тўғри хулосалар чиқаришга ёрдам беради.\n\n" \
                    "- Конверсиянинг юқори даражаси: бизнинг бот кенг қамровли аудитория ва энг мос каналлар ҳамда " \
                    "блогерларни танлаш орқали конверсиянинг юқори даражасини кафолатлайди.\n\n" \
                    "- Ишончлилик ва хавфсизлик: бизнинг бот реклама жойлаштириш ва тўловларни амалга " \
                    "ошириш жараёнида ишончлилик ҳамда хавфсизликни таъминлайди."

        class common:
            rules = "Сервисдан фойдаланишдан аввал «Сервис қоидалари» билан танишиб чиқинг, " \
                    "«✅ Розиман» тугмасини босиш орқали сиз хизмат шартлари билан танишганингиз ва унга рози эканингизни тасдиқлайсиз."
            rules1 = "Сервисдан фойдаланишдан аввал "
            rules2 = "«Сервис қоидалари»"
            rules3 = " билан танишиб чиқинг, «✅ Розиман» тугмасини босиш орқали сиз хизмат шартлари билан танишганингиз ва унга рози эканингизни тасдиқлайсиз"
            login = "<b>Аккаунтни рўйхатдан ўтказиш</b>\n\n" \
                   "Электрон почта манзилингизни киритинг, тасдиқлаш коди ушбу манзилга юборилади"
            email = "<b>Аккаунтни рўйхатдан ўтказиш</b>\n\n" \
                   "Код электрон почтага юборилди"
            code = "Тасдиқлаш кодини киритинг👇"
            password = "<b>Аккаунтни рўйхатдан ўтказиш</b>\n\n" \
                       "Ишончли пароль киритинг👇\n" \
                       "<i>Камида 8 белги</i>"
            blogger = "Бизнинг ботимиз реклама жараёнини автоматлаштириш учун кўплаб каналлар ва блогерлар орасидан " \
                      "кенг танлов, рекламани тезкорлик билан жойлаштириш, вақт ва маблағни тежаш, натижаларни " \
                      "кузатиш ва юқори конверсия даражаси каби кўплаб қулайлик ва имтиёзларни тақдим этади."

    class platform:
        class blogger:
            request = "💬 Майдонча модерация 👇"
            date_request = "🗓 Ариза берилган сана"
            add = "<b>Майдонча қўшиш</b>\n\nМайдончангизнинг платформасини танланг👇"
            telegram = "<b>Майдонча қўшиш</b>\n\n" \
                       "Майдончага ҳаволани қуйидаги форматда юборинг:\n\n" \
                       "https://t.me/telegramchannel"
            instagram = "<b>Майдонча қўшиш</b>\n\n" \
                       "Майдончага ҳаволани қуйидаги форматда юборинг:\n\n" \
                       "https://instagram...."
            facebook = "<b>Майдонча қўшиш</b>\n\n" \
                       "Майдончага ҳаволани қуйидаги форматда юборинг:\n\n" \
                       "https://facebook...."
            youtube = "<b>Майдонча қўшиш</b>\n\n" \
                       "Перешлите любой видеоролик из вашей YouTube площадки:\n\n" \
                       "https://youtube...."
            dict = {1: telegram,3: instagram, "facebook": facebook, 2: youtube}
            title = "<b>Майдонча қўшиш</b>\n\nМайдонча номини киритинг 👇"
            checkTelegram1 = "<b>Майдонча қўшиш</b>\n\n" \
                             "Майдончага эгалик ҳуқуқингизни тасдиқлашингиз лозим.\n\n" \
                             "Код"
            checkTelegram2 = "Каналингиз тавсифига ушбу кодни қўшинг ва <b>«🔎 Текшириш»👇</b> тугмасини босинг.\n\n" \
                             "<i>Текшириш бир неча сония давом этади, бу каналга бўлган ҳуқуқларингизни тасдиқлаш " \
                             "учун керак, текширув муваффақиятли ўтгач, уни дарҳол ўчириб ташлашингиз мумкин.</i>"

            category = "<b>Майдонча қўшиш</b>\n\nМайдончанинг категориясини кўрсатинг👇"
            lang = "<b>Майдонча қўшиш</b>\n\nАудитория тилини кўрсатинг👇"
            region = "<b>Майдонча қўшиш</b>\n\nАудитория ҳудудини кўрсатинг👇"
            description = "<b>Майдонча қўшиш</b>\n\n" \
                          "Майдонча тавсифи👇\n\n" \
                          "<i>Майдончангизни каталогда алоҳида ажратиб турадиган ўзига хос хусусиятларини кўрсатиб " \
                          "беринг, кўпи билан 150 тагача белги</i>"
            sex = "<b>Майдонча қўшиш</b>\n\nАудитория жинсининг нисбатини кўрсатинг, %"
            age = "<b>Майдонча қўшиш</b>\n\nАудиториянинг ўртача ёшини кўрсатинг, ёш"
            add_format = "<b>Майдонча қўшиш</b>"
            format = "Реклама нархининг сизга мос келадиган жойлаштириш форматларини кўрсатинг👇"
            price = "Жойлаштириш нархини киритинг\n" \
                    "<i>пробеллар, ортиқча белгилар ва ҳарфларсиз, бутун сон, масалан:</i>\n\n1435000"
            symbol = "Агар реклама постида белгилар сонига чеклов бўлса, уни кўрсатинг👇" \
                     "<i>Пробел ва бошқа белгиларсиз бутун сон киритинг, масалан</i>:\n\n1554"
            end = "Майдончани қўшиш тўғрисидаги сўров модерацияга юборилди. Жавоб келиш муддати  — <b>24 соатгача.</b>\n\n" \
                  "Тизимда ишлашни бошлаш учун маълумотларни киритиш лозим👇"
            wholeCountry = "Бутун Узбекситон"
            newAdd = "Майдончани қўшиш тўғрисидаги сўров модерацияга юборилди. Жавоб келиш муддати  — <b>24 соатгача.</b>"
            delete = "Сиз ҳақиқатан ҳам майдончани ўчириб ташламоқчимисиз?\n" \
                     "Ушбу ҳаракатни қайтариб бўлмайди, барча майдонча маълумотлари ушбу хизматдан ўчирилади."
            delete_end = "Майдонча сервис маълумотлар базасидан муваффақиятли ўчирилди."
            calendar = "<b>🗓 Календарь</b>\n\nБанд қилинган саналарни кўрсатинг, бу маълумотни реклама берувчилар кўради👇"
            nextTime = "Модерация учун қайтадан сўров юбориш имкони мавжуд"

            class change:
                title = "<b>✍ Маълумотларни ўзгартириш</b>\n\nМайдонча номини киритинг 👇"
                category = "<b>✍ Маълумотларни ўзгартириш</b>\n\nМайдончанинг категориясини кўрсатинг 👇"
                lang = "<b>✍ Маълумотларни ўзгартириш</b>\n\nАудитория тилини кўрсатинг👇"
                region = "<b>✍ Маълумотларни ўзгартириш</b>\n\nАудитория ҳудудини кўрсатинг 👇"
                description = "<b>✍ Маълумотларни ўзгартириш</b>\n\n" \
                                  "Майдонча тавсифи👇\n\n" \
                                  "<i>Майдончангизни каталогда алоҳида ажратиб турадиган ўзига хос хусусиятларини кўрсатиб " \
                                  "беринг, кўпи билан 150 тагача белги</i>"
                sex = "<b>Мақсадли аудитория</b>\n\nАудитория жинсининг нисбатини кўрсатинг, %"
                age = "<b>Мақсадли аудитория</b>\n\nАудиториянинг ўртача ёшини кўрсатинг, ёш"
                format = "<b>✍ Маълумотларни ўзгартириш</b>\n\nРеклама нархининг сизга мос келадиган жойлаштириш форматларини кўрсатинг👇"
                audience = "<b>Мақсадли аудитория</b>"

            class form:
                check = "Маълумотларни текширинг ва тасдиқланг👇"
                title = "Номни ўзгартириш"
                description = "Тавсифни ўзгартириш"
                parameters = "Аудитория параметрлари"
                price = "Реклама жойлаштириш нархи"
                platform = "Майдон"
                sex = "Жинс"
                age = "Ёш"
                lang = "Тил"
                region = "Ҳудуд"
                category = "Категория"
                symbol1 = "✍ битта постда"
                symbol2 = "тагача белги"
                all_platform = "Сизнинг майдончаларингиз"

                date = "Блоклаш санаси"
                reason = "Сабаби"

    class personalData:
        class common:
            data = "Сизнинг маълумотларингиз👇"
            start = "Тизимда ишлашни бошлаш учун маълумотларни киритиш лозим👇"
            choose = "Қуйидагилар орасидан танланг👇"
            fio = "Ф.И.Ш."
            fioCard = "Ф.И.Ш. (UZCARD/HUMOда)"
            number = "Рўйхатдан ўтиш рақами"
            date = "Рўйхатдан ўтган сана"

            titleFirm = "Компаниянинг номи"
            titleIndividual = "Якка тартибдаги тадбиркорнинг номи"

            legalAddress = "Юридик манзили"
            transitAccount = "Транзит ҳисоб рақами"
            inn = "ИНН"
            pinfl = "ЖШШИР"
            paymentAccount = "Ҳисоб рақами"
            bank = "Банк номи"
            mfo = "Банк МФО"
            phone = "Телефон"
            cardNumber = "Карта рақами (UZCARD/HUMO)"
            cardDate = "Карта санаси (UZCARD/HUMO)"
            titleEntity = "Компаниянинг номи"
            title2 = "Номи"
            alright = "Ҳаммаси тўғрими?"
            changeData = "Тузатишлар киритиш👇"
            newDataFio = "Янги маълумотларни киритиш👇\n\n<b>Ф.И.Ш.ни паспортдагидек лотин ҳарфларида киритинг, масалан::</b>\n\nHakimov Arslanbek Valijon o’g’li"
            newDataFioCard = "Янги маълумотларни киритиш👇\n\n<b>Фамилия ва исмингизни картадагидек (UZCARD/HUMO) лотин ҳарфларида киритинг, масалан:</b>\n\nHakimov Arslanbek"
            newDataNumber = "Янги маълумотларни киритиш👇\n\n<b>Ўзини ўзи банд қилганлик тўғрисидаги маълумотномангиз рақамини “№” БЕЛГИСИСИЗ киритинг, масалан:</b>\n\n0002713050\n\n<i>Эслатма: ушбу рақам ўзини ўзи банд қилганлик тўғрисидаги файлда ҳужжат сарлавҳасида жойлашган</i>"
            newDataDate = "Янги маълумотларни киритиш👇\n\n<b>Рўйхатдан ўтиш санасини қўшимча пробеллар, вергуллар ва бошқа белгиларсиз, кк.оо.йййй форматида киритинг, масалан:</b>\n дд.мм.гггг \n\nНапример: 22.03.2022"
            newDataTitleEntity = "Янги маълумотларни киритиш👇\n\n<b>Юридик шахс номи</b>"
            newDataTitleIndividual = "Янги маълумотларни киритиш👇\n\n<b>ЯТТ номи, Ф.И.Ш.ни паспортдагидек лотин ҳарфларида киритинг</b>"
            newDataLegalAddress = "Янги маълумотларни киритиш👇\n\n<b>Юридик манзил</b>"
            newDataInn = "Янги маълумотларни киритиш👇\n\n<b>СТИРни ортиқча пробел, вергуллар ва бошқа белгиларсиз рақам шаклида киритинг</b>"
            newDataPinfl = "Янги маълумотларни киритиш👇\n\n<b>ЖШШИРни пробел, вергул ва бошқа белгиларсиз рақамли форматда киритинг </b>"
            newDataPaymentAccount = "Янги маълумотларни киритиш👇\n\n<b>Ҳисоб рақамини ортиқча пробел, вергуллар ва бошқа белгиларсиз рақам шаклида киритинг</b>"
            newDataTransitAccount = "Янги маълумотларни киритиш👇\n\n<b>Транзит ҳисоб рақамини ортиқча пробел, вергуллар ва бошқа белгиларсиз киритинг</b>"
            newDataBank = "Янги маълумотларни киритиш👇\n\n<b>Хизмат кўрсатувчи банк номини киритинг</b>"
            newDataMfo = "Янги маълумотларни киритиш👇\n\n<b>Банк МФО 5 хонали сонни ортичқча пробеллар, вергул ва бошқа белгиларсиз киритинг</b>"
            newDataPhone = "Янги маълумотларни киритиш👇\n\n<b>Контакт маълумотларингизни ортичқча пробеллар, вергул ва бошқа белгиларсиз қуйидаги форматда киритинг:</b>\n\n+998901234567\nёки \n+998711234567"
            newDataCardNumber = "Янги маълумотларни киритиш👇\n\n<b>Карта рақамини (UZCARD/HUMO) ортиқча пробел, вергуллар ва бошқа белгиларсиз киритинг, масалан: </b>\n\n8600123412341234 ёки 9800123412341234"
            newDataCardDate = "Янги маълумотларни киритиш👇\n\n<b>Введите дату карты (UZCARD/HUMO) в формате мм/гг, например:</b>\n\n05/25"

            moderation = "Модерациядан ўтгач, сизга хабар берамиз ва майдончангиз реклама берувчилар учун фаоллаштирилади\n\n" \
                         "Модерация муддати - <b>24 соатгача</b>"
            account = "Аккаунт"
            logout = "Ҳақиқатан ҳам аккаунтдан чиқмоқчимисиз? "

    class wallet:

        balance = "Баланс"
        putOn = "<b>Тўлдириш суммасини кўрсатинг</b>\nВергул, пробел ва бошқа белгиларсиз бутун сон қийматини киритинг, " \
                "масалан:\n\n 575100\n\n<i>Тўлдиришнинг минимал миқдори – 30 000 сўм👇</i>"
        about = ""
        choose = "Тўлдириш усулини танланг👇\n\n"
        amount = "Тўлдириш суммаси"
        payment = "Ушлаб қолинадиган сумма"
        method = "Тўлов усули"
        press_button = "Тўлов ойнасига ўтиш учун <b>«✅ Тўлаш»</b> тугмасини босинг 👇"

        success = "✅ Тўлов муваффақиятли амалга оширилди.\n<b>Баланс тўлдирилди</b>"
        sum = 'сўм'
        end = "Буюртма тасдиқлаш учун блогерларга юборилди. Тасдиқлангандан сўнг сизга хабар жўнатилади.\n\n" \
               "Сервис хавфсиз битим тизимида ишлайди: блогер барча мажбуриятларни бажаргач ва сиз буни " \
               "тасдиқлаганингиздан кейин маблағни олади.\n\n" \
               "Буюртма ҳақидаги батафсил маълумот <b>«🗓 Реклама буюртмалари»👇</b> бўлимида"
        didox = "Имзоланган шартнома ва тўлов учун ҳисоб-фактура Didox тизими орқали юборилди.\n" \
                "Тўловни амалга ошириш учун сизда <b>12 соат</b> вақт бор "
        withdraw = "Суммани киритинг👇\n" \
                   "<i>Пробел, вергуллар ва бошқа белгиларсиз бутун сон қийматида, масалан:</i>\n" \
                   "570000\n\n" \
                   "Пул ечиб олиш учун комиссия – 3%. "
        payDay = "Тўлов кейинги операцион кунда амалга оширилади: <i>душанба, чоршанба, жума.</i>"
        commission = "Пул ечиб олиш учун комиссия – 3%."

        entity = "Юридик шахс сифатида"
        individual = "ЯТТ сифатида"
        selfEmployedAccount = "Ўзини ўзи банд қилган шахс (ҳисоб рақами)"
        selfEmployedCard = "Ўзини ўзи банд қилган шахс (UZCARD/HUMO)"
        credit = "Ўтказма суммаси"
        mark = "<i>(шу жумладан 3% комиссия).</i>"
        operationDay = "Энг яқин операцион кун "
        request = "💵 Пулни ечиб олиш учун ариза"
        date_request = "🗓 Ариза берилган сана"

        class payment_start:
            cash = "Ушлаб қолинадиган сумма"
            nds = "(12% ҚҚС билан) "
            method = "Тўлдириш усулини танланг👇"

        class history:
            deposit = "➕ Маблағ тўлдириш"
            withdraw = "➖ Пул ечиб олиш"
            writeOff = "➖ Пул маблағларидан ушлаб қолиш"
            reject = "➕ Маблағни қайтариш"
            complete = "➕ Лойиҳани бажариш"

            platform = "Майдон"
            campaign = "Компаниянинг номи"
            method = "Усули"
            cash = "Сумма"
            date = "Сана"
            status = "Ҳолати"
            completed = "Бажарилган"
            rejected = "Рад этилган"
            reason = "Сабаб"
            expects = "Бажарилиши кутилмоқда"
            sum = 'сўм'
            commission = "(шу жумладан 3% комиссия)"

    class group:

        class withdraw:
            class group:
                reason = "⛔ Укажите причину отмены👇"
                accept = "✅ Средства выведены, мы уведомили пользователя."
                reject = "⛔ Заявка отменена."

            class user:
                reason = "Сабаб"
                accept = "Пулни ечиб олиш бўйича сўровингиз бажарилди! "
                reject = "⛔ Пул ечиб олиш бўйича сўровингиз рад этилди!"
                cash = "Ўтказма суммаси"
                commission = "(шу жумладан комиссия)"
                sum = 'сўм'
                wallet = "Сиз транзакциялар тарихини  <b>💳 Ҳамён  —> 🗓 Транзакция тарихи</b>"
                back = "Маблағ ҳамёнингизга қайтарилди "

        class moderation:
            class group:
                reason = "⛔ Укажите причину отклонения👇"
                accept = "✅ Площадка стала активной, мы уведомили блогера."
                reject = "⛔ Заявка отклонена, мы уведомили блогера."
                ban = "⛔ Площадка заблокирована, мы уведомили блогера."
                unban = "✅ Площадка разблокирована, мы уведомили блогера."

            class user:
                reason = "Сабаби"
                accept = "✅ Майдончангиз модерациядан ўтди ва сервисда реклама берувчилар учун фаоллашди."
                reject = "⛔ Майдонча модерация жараёнида рад этилди."
                platform = "Майдонча"
                myPlatform = "Майдонча ҳақидаги барча маълумотларни  «💬 Менинг майдончаларим» бўлимида кўришингиз мумкин"
                ban = "⛔ Майдонча блокдан чиқарилди"
                unban = "✅ Майдонча блокланди"

        class post:
            solution = "Решение принято, результат отправлен блогеру и рекламодателю"

    class formOrder:
        about = "Биз платформамизда реклама қилиш учун оддий ва тушунарли усулларни таклиф қиламиз.  " \
                "Сиз ўзингизга энг мос канал ёки блогерни танлайсиз, реклама жойлаштириш шартларини муҳокама қиласиз ва хизматлар учун ҳақ тўлайсиз. " \
                "Биз битим хавфсизлигини кафолатлаймиз ва тўловларнинг ишончлили бўлишини таъминлаймиз. " \
                "Рекламангиз юқори сифатли сайтларга жойлаштирилиши ва мақсадли аудиторияга этиб боришига ишончингиз комил бўлсин."

        select = "Сизнинг мақсадли аудиториянгизга мос майдончани танлаймиз👇"
        find = "🔎 Текст номини киритинг👇"
        campaign = "Реклама кампаниясининг номини киритинг👇"
        campaignText = "Эълон қилмоқчи бўлган нарсангизни ботга юборинг. " \
                       "Бу ҳар қандай кўринишда бўлиши мумкин – матн, фото, видео, ҳатто стикерлар ҳам.\n" \
                       "<i>✍ ИЁки блогер бажариши лозим бўлган техник топшириқни батафсил баён қилиб беринг.</i>"
        campaignText2 = "Бу ерда муваффақиятли реклама постларига намуналар келтирилган"
        media = "<b>📎 Файлларни бириктириш</b>\n\n" \
                "Ҳужжатлар, расмлар, видео ва архивлар юборилиши мумкин\n" \
                "Файлнинг максимал ҳажми 20mb"
        url = "URL-тугмалар рўйхатини битта хабарда менга юборинг. Кўпи билан 3 тагача тугма қўшиш мумкин." \
              "Илтимос, қуйидаги форматга амал қилинг:\n\n" \
              "1 тугма - https://example1.com\n" \
              "2 тугма - https://example2.com\n" \
              "Учтагача тугмани битта қаторга жойлаштириш учун “|” ажраткичидан фойдаланинг.\n" \
              "Масалан:\n\n" \
              "1 тугма - https://example1.com | 2 тугма - https://example2.com\n" \
              "3 тугма - https://example3.com | 4 тугма - https://example4.com"
        comment =  "Топшириққа изоҳ ёзинг👇"
        task = "Техник топшириқни киритинг👆 \n\nИзоҳ"
        all_dates = "Постларни жойлаштириш санасини кўрсатинг👇"
        date = "Постни жойлаштириш санасини танланг👇"
        time = "Постни жойлаштиришнинг ўзингизга маъқул вақтини танланг. Бир нечтасини кўрсатиш мумкин👇"
        alright = "Ҳаммаси тўғрими?"

        class form:

            category = "Бизнес категорияси"
            sex = "Жинс"
            age = "Ёш"
            lang = "Аудитория тили"
            region = "Ҳудуд"
            network = "Ижтимоий тармоқ"
            select_business = "Бизнесингиз йўналишини кўрсатинг, бир нечтасини танлаш мумкин👇"
            description = "Тавсиф"
            sum = 'сўм'

        class change:
            category = "<b>✍ Маълумотларни ўзгартириш</b>\n\nУкажите категорию площадки 👇"
            lang = "<b>Мақсадли аудитория</b>\n\nУкажите язык аудитории👇"
            region = "<b>Мақсадли аудитория</b>\n\nУкажите регион аудитории 👇"
            sex = "<b>Мақсадли аудитория</b>\n\nУкажите соотношение полов аудитории, %"
            age = "<b>Мақсадли аудитория</b>\n\nУкажите средний возраст аудитории, лет"
            network = "<b>Соцсеть</b>\n\nВыберите соцсети для вашей рекламы👇"
            audience = "<b>Мақсадли аудитория</b>"

        class basket:
            basket = "Саватчамизда"
            subscribers = "👥 Жами иштирокчилар"
            coverage = "👀 Умумий қамров"
            commission = "Сервис комиссияси  — 3%"
            nds = "ҚҚС — 12%"
            cost = "Буюртманинг якуний суммаси"
            status = "<b>Ҳолати:</b> Бажарилган"

        class payment:
            success = "✅ Тўлов муваффақиятли."
            wallet = "Ҳамёндан ечиб олинди"
            payment = "Буюртма тасдиқлаш учун блогерларга юборилди. Тасдиқлангандан сўнг сизга хабар жўнатилади.\n\n" \
                      "<i>Сервис хавфсиз битим тизимида ишлайди: блогер барча мажбуриятларни бажаргач ва сиз " \
                      "буни тасдиқлаганингиздан кейин маблағни олади.</i>\n\n" \
                      "Буюртма ҳақидаги батафсил маълумот <b>«🗓 Реклама буюртмалари»</b> бўлимида 👇"
            sum = 'сўм'
            fail = "Ҳамёнда маблағ етарли эмас"
            count = "Харид қилиш учун балансингизни тўлдиришингиз лозим"

        class blogger:
            new = "Сизда янги буюртма бор"
            name = "Лойиҳа номи"
            platform = "Майдонча"
            accommodation = "Формат"
            price = "Нархи"
            date = "Эълон қилиш санаси"
            time = "Вақт бўйича талаб"
            comment = "Изоҳ"
            attention = "❗ Сизда <b>12 соат</b> вақт бор. Бу вақт ичида сиз буюртмани қабул қилишингиз ёки рад қилишингиз керак."
            accepted = "Лойиҳа қабул қилинди!"
            post_review = "🔍 Кўриб чиқилаётган пост"
            post = "Постга ҳавола"
            completed = "✅ Реклама пости реклама берувчи томонидан қабул қилинди."
            cash = "Тўлдириш суммаси"
            sum = 'сўм'

    class allOrder:
        expects = "⏱ Қабул қилиш кутиляпти"
        active = "🚀 Фаол буюртмалар"
        completed = "🗓 Бажарилганлар"
        choose = "Қуйидагилар орасидан танланг👇"
        platform = "Майдонча"

    class newOrder:
        class blogger:
            message = "💬 Сизда янги хабар бор"
            accept_project = "Лойиҳа қабул қилинди"
            accept_advertiser = "✅ Реклама пости реклама берувчи томонидан қабул қилинди."
            reject = "⛔ Лойиҳа рад этилди, биз реклама берувчини лойиҳа бекор қилинганлиги ҳақида хабардор қилдик.\n" \
                     "<i>Эслатма! Буюртмаларни тез-тез бекор қилиш сервисда майдончани блокировка қилишга олиб келади.</i>"
            accept = "<b>Лойиҳа қабул қилинди!</b>\n\n" \
                     "Сизга шуни эслатиб ўтамизки, танланган жойлаштириш вақтига қараб, сиз реклама постини белгиланган " \
                     "кунда жойлаштиришингиз керак, сўнгра реклама берувчига эълон қилинган постга ҳаволани текшириш учун юборишингиз керак:\n\n" \
                     "<b>🗓 Реклама буюртмалари —> * Майдонча —> * Реклама кампаниясининг номи —> Текширувга юбориш</b>\n\n" \
                     "Акс ҳолда сервис қоидаларига мувофиқ, буюртма бажарилмади деб топилади ва маблағ балансингизга ўтказилмайди"
            cancel = "Жойлаштиришни рад этмоқчи эканлигингизга ишончингиз комилми? Ушбу ҳаракатни қайтариб бўлмайди, маблағлар реклама берувчига қайтарилади."
            sendMessage =  "💬 Ушбу хабарга жавоб орқали (Reply/Ответить) жавоб йўлланг."
            end = "Хабар етказилди"
            postPost = "Сиз реклама постини буюртмада кўрсатилган барча талабларга мувофиқ жойлаштирдингиз.\n\n" \
                       "Сиз реклама постини жойлаштириш формати тугагунига қадар уни ўчирмасликка розилик билдирасиз.\n\n" \
                       "Постни текширувга юбориш учун, реклама постига ҳаволани юборинг 👇 "
            checkPost = "Пост текширувга юборилди.\n\n" \
                        "Реклама берувчи пост жойлаштирилганлигини тасдиқлагач, маблағ сизнинг ҳисобингизга ўтказилади."

        class advertiser:
            message = "💬 Сизда янги хабар бор"
            accept = "✅ Блогер лойиҳани қабул қилди."
            reject = "⛔ Блогер лойиҳани рад этди. Маблағлар ҳамёнингизга қайтарилди."
            info = "Блогер реклама пости жойлаштирилганлиги тўғрисидаги тасдиқни юборади.\n\n" \
                   "Буюртма ҳақидаги батафсил маълумот <b>«🗓 Реклама буюртмалари» бўлимида</b> "
            postCheck = "❗ Лойиҳанинг барча талаблари бажарилган бўлса, жойлаштирувни тасдиқланг."
            sendBlogger = "<b>💬 Написать блогеру</b>\n\nВыберите площадку👇 "
            sendMessage = "💬 Ушбу хабарга жавоб орқали (Reply/Ответить) жавоб йўлланг."
            end = "Хабар етказилди"
            postAccept = "✅ Лойиҳа қабул қилинди! Реклама учун маблағ блогер ҳамёнига ўтказиб берилди."
            postCancel = "⛔ Агар хатоларга йўл қўйилган бўлса ёки пост чоп этилмаган бўлса, блогер жойлаштирув учун маблағ ололмайди.\n\n" \
                         "Вазиятга ойдинлик киритиш учун ариза модерацияга юборилади."
            postReject = "Қарор модерация орқали 24 соат ичида қабул қилинади, маблағлар ҳамёнингизга қайтарилади, " \
                         "блогер қоидаларни бузди"
            rate = "⭐ Майдончани баҳолаш"
            thanks = "Баҳолаганингиз учун ташаккур, бу сервис ва майдончалар сифати устидан назоратни яхшилашга ёрдам беради"

    class postModeration:
        class blogger:
            accept1 = "✅ "
            accept2 = "майдончасидаги реклама пости реклама берувчи томонидан қабул қилинди. "
            cash = "Тўлдириш суммаси"
            sum = "сўм"
            reject = "⛔ Реклама пости реклама берувчи томонидан рад этилди, биз рад этиш сабабларини ўрганмоқдамиз.\n" \
                     "Агар сиз томонингиздан буюртма шартлари бажарилмаган бўлса, маблағлар реклама берувчининг ҳисобига қайтарилади."
            reject2 = "⛔ Реклама пости реклама берувчи томонидан рад этилди."

        class group:
            class blogger:
                moderation_blogger = "Модерация блогер фойдасига қарор қабул қилди. Лойиҳанинг барча талаблари бажарилган. Буюртма учун маблағлар ҳамёнингизга ўтказилди."
                moderation_advertiser = "Модерация реклама берувчининг фойдасига қарор қабул қилди. Маблағлар реклама берувчининг ҳамёнига қайтарилди. "
                reminder = "Ёдда тутинг! Хизмат қоидаларини тез-тез бузганлик учун сиз тизимдан чекланмаган муддатга блокланасиз."
                apology = "Келтирилган ноқулайликлар учун узр сўраймиз, сервис қоидаларини тез-тез бузганлик учун реклама берувчи тизимдан блокланади."

            class advertiser:
                moderation_blogger = "Модерация блогер фойдасига қарор қабул қилди. Лойиҳанинг барча талаблари бажарилган."
                moderation_advertiser = "Модерация реклама берувчининг фойдасига қарор қабул қилди, маблағлар ҳамёнингизга қайтарилди."
                reminder = "Ёдда тутинг! Хизмат қоидаларини тез-тез бузганлик учун сиз тизимдан чекланмаган муддатга блокланасиз."
                apology = "Келтирилган ноқулайликлар учун узр сўраймиз, сервис қоидаларини тез-тез бузганлик учун блогер тизимдан блокланади."

    class banPlatform:
        class group:
            start = "Введите название реплеем(Reply/Ответить) на это сообщение и я вам выдам список площадок\n\n" \
                    "<b>Минимальное количество символов — 5</b>"

    class alert:
        class common:
            error = "Эйй.... Нимадир нотўғри юборилди"
            nonFormat = "Нотўғри формат, қайтадан киритинг👇"
            existUser = "Бундай почтадан аввал аккаунт очилган"
            nonAccount = "Бундай почтага боғланган аккаунт топилмади👇"
            invalidUrl = "Ҳавола нотўғри"
            invalidCode = "Код нотўғри."
            invalidPassword = "Парол нотўғри, қайтадан теринг👇"
            strongPassword = "Ишончли пароль киритинг👇\nКамида 8 белги"
            invalidLink = "Ҳавола нотўғри,\nуни бехато киритинг👇"
            lengthTitle = "Белгилар сони кўпи билан - 20 шт"
            lengthLegalAddress = "Белгилар сони кўпи билан - 50 шт"
            lengthDescription = "Белгилар сони кўпи билан - 150 шт"
            lengthPrice = "Пробеллар, ортиқча белгилар ва ҳарфларсиз, бутун сон\nБелгилар сони кўпи билан - 9 шт"
            price = "Пробеллар, ортиқча белгилар ва ҳарфларсиз, бутун сон, масалан:\n\n1435000👇"
            allData = "Барча зарур маълумотларни тўлдиришингиз керак "
            successUpdate = "✅ Маълумотлар янгиланди"
            notEnoughMoney = "Миқдор жуда кам, энг кам тўлдириш суммаси  30 000 сўм👇"
            notEnoughMoneyOnWallet = "Ҳамёнингизда олиш мумкин бўлган суммани киритинг. Бўш жой, ортиқча белгилар ва " \
                                     "ҳарфларсиз ёзинг, масалан: 575100\n\n<i>Пулни ечиб олиш учун комиссия  — 3 %</i>"
            lengthMax = "Белгилар сони ҳаддан ташқари кўп, қисқароқ ёзинг👇"
            calendar = "Санани тўғри танланг"
            zeroCount = "Рўйхат бўш"
            minPayment = "Тўлдиришнинг минимал миқдори – 30 000 сўм👇"
            minWithdraw = "Минимал ечиб олиш суммаси - 30 000 сўм👇"

        class blogger:
            minPrice = "Жойлаштиришнинг энг кам нархи 10 000 сўм👇"
            lang = "Камида битта тилни кўрсатиш лозим"
            region = "Камида битта ҳудудни кўрсатиш лозим"
            age = "Камида битта ёшни кўрсатиш лозим"
            price = "Камида битта реклама жойлаштириш форматини кўрсатиш лозим"
            success = "Маълумотлар муваффақиятли якунланди"
            free = "✅ Энди бу сана бўш ёки"
            busy = "🔒 Энди бу сана банд"
            telegram_success = "✅ Текширув муваффақиятли ўтди, кодни ўчириб ташлашингиз мумкин"
            telegram_error = "⛔ Канал тавсифида код топилмади"
            postDate = "❗ Постни жойлаштиришга ҳали эрта, топшириқда кўрсатилган санага қаранг."
            instagram = "Instagram Coming Soon"
            platformExist = "⛔ Бу майдонча платформага аввал қўшилган ёки модерация жараёнида"
            platformReject = "Ушбу майдончани қўшиш модерация жараёнида рад этилган"
            platformBan = "Майдончага сервис маъмурияти томонидан тақиқ қўйилган"

        class advertiser:
            lengthPost = "Белгилар сони ҳаддан ташқари кўп. Рухсат этилган белгилар сони — 1500 тa"
            lengthComment = "Maтн ҳаддан ташқари узун. Рухсат этилган қиймат — 100 та белги"
            lengthButton = "URL- тугмалар ҳаддан ташқари кўп. Рухсат этилган қиймат — 3 та URL-тугма"
            category = "Бизнес категориясини кўрсатиш лозим"
            searchMin = "Kaмида 3 та ҳарф киритинг👇"
            allDates = "Барча танланган майдончаларда жойлаштириш саналарини кўрсатинг."
            busy = "Афсуски, бу сана банд. Сиз бошқа кунни танлашингиз мумкин."
            emptyBasket = "Саватча бўш"
            chooseChannel = "Kaналларни танланг"
            startCampaign = "✅ Реклама кампанияси муваффақиятли ишга туширилди!\n\n💬 Буюртмалар блогерларга тарқатилмоқда..."
            maxBasket = "Кўпи билан 40 та майдонча кўрсатиш мумкин"

        class group:
            nonModeration = "Нет новых 💬 Площадкок на модерации"
            nonWithdraw = "Нет новых 💵 Заявок на вывод средств"
            lenPlatform = "Минимальное количество символов — 5"
            nonPlatform = "Нет площадок по вашему запросу"
